; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	thermograph1 - mode
	thermograph2 - mode
	infrared4 - mode
	infrared0 - mode
	image3 - mode
	Star25 - direction
	GroundStation27 - direction
	Star36 - direction
	Star12 - direction
	Star5 - direction
	GroundStation4 - direction
	Star21 - direction
	Star32 - direction
	GroundStation38 - direction
	GroundStation20 - direction
	GroundStation17 - direction
	Star35 - direction
	Star14 - direction
	Star1 - direction
	GroundStation29 - direction
	GroundStation13 - direction
	Star15 - direction
	Star7 - direction
	GroundStation39 - direction
	Star23 - direction
	Star24 - direction
	GroundStation2 - direction
	GroundStation26 - direction
	GroundStation18 - direction
	Star10 - direction
	Star6 - direction
	Star16 - direction
	GroundStation28 - direction
	GroundStation37 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Star33 - direction
	GroundStation30 - direction
	Star3 - direction
	Star9 - direction
	GroundStation0 - direction
	Star19 - direction
	GroundStation22 - direction
	GroundStation34 - direction
	GroundStation31 - direction
	Phenomenon40 - direction
	Planet41 - direction
	Phenomenon42 - direction
	Star43 - direction
	Star44 - direction
	Planet45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Planet48 - direction
	Phenomenon49 - direction
	Phenomenon50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Star53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Phenomenon56 - direction
	Planet57 - direction
	Planet58 - direction
	Star59 - direction
	Phenomenon60 - direction
	Planet61 - direction
	Planet62 - direction
	Star63 - direction
	Phenomenon64 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared4)
	(supports instrument0 image3)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 Star21)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 GroundStation17)
	(calibration_target instrument0 GroundStation37)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star33)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 GroundStation30)
	(calibration_target instrument0 GroundStation31)
	(calibration_target instrument0 GroundStation20)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star24)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 Star33)
	(calibration_target instrument1 Star35)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star25)
	(calibration_target instrument1 Star21)
	(calibration_target instrument1 GroundStation18)
	(calibration_target instrument1 Star15)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star21)
	(calibration_target instrument2 Star32)
	(calibration_target instrument2 GroundStation39)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 Star36)
	(calibration_target instrument2 Star1)
	(supports instrument3 image3)
	(supports instrument3 infrared4)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation30)
	(calibration_target instrument3 Star21)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 GroundStation39)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 GroundStation20)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation17)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star14)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument4 image3)
	(supports instrument4 infrared4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation29)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 GroundStation18)
	(calibration_target instrument4 GroundStation17)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 Star33)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star32)
	(calibration_target instrument4 GroundStation39)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation20)
	(calibration_target instrument5 GroundStation37)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation38)
	(calibration_target instrument5 Star9)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared4)
	(calibration_target instrument6 Star35)
	(calibration_target instrument6 GroundStation13)
	(calibration_target instrument6 GroundStation17)
	(calibration_target instrument6 GroundStation18)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star63)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation13)
	(calibration_target instrument7 GroundStation29)
	(calibration_target instrument7 GroundStation39)
	(calibration_target instrument7 GroundStation22)
	(calibration_target instrument7 Star10)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star19)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 Star14)
	(supports instrument8 infrared4)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 GroundStation37)
	(calibration_target instrument8 GroundStation39)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 Star15)
	(calibration_target instrument8 GroundStation11)
	(calibration_target instrument8 Star19)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation31)
	(supports instrument9 image3)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation18)
	(calibration_target instrument9 GroundStation26)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 GroundStation30)
	(calibration_target instrument9 GroundStation22)
	(calibration_target instrument9 Star33)
	(calibration_target instrument9 Star24)
	(calibration_target instrument9 Star23)
	(supports instrument10 thermograph1)
	(supports instrument10 image3)
	(calibration_target instrument10 Star9)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 GroundStation30)
	(calibration_target instrument10 Star33)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 GroundStation11)
	(calibration_target instrument10 GroundStation37)
	(calibration_target instrument10 GroundStation28)
	(calibration_target instrument10 Star16)
	(calibration_target instrument10 Star6)
	(calibration_target instrument10 Star10)
	(calibration_target instrument10 Star19)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation22)
	(calibration_target instrument11 Star19)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 infrared0)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation31)
	(calibration_target instrument12 GroundStation34)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation30)
)
(:goal (and
	(pointing satellite1 Planet57)
	(pointing satellite2 Phenomenon40)
	(pointing satellite3 Star16)
	(have_image Phenomenon40 infrared0)
	(have_image Planet41 infrared0)
	(have_image Phenomenon42 infrared0)
	(have_image Star43 thermograph2)
	(have_image Star44 thermograph2)
	(have_image Planet45 infrared0)
	(have_image Phenomenon46 infrared0)
	(have_image Planet47 image3)
	(have_image Planet48 infrared0)
	(have_image Phenomenon49 infrared0)
	(have_image Phenomenon50 thermograph1)
	(have_image Planet51 image3)
	(have_image Phenomenon52 thermograph1)
	(have_image Star53 thermograph1)
	(have_image Phenomenon54 thermograph1)
	(have_image Planet55 infrared4)
	(have_image Phenomenon56 thermograph1)
	(have_image Planet57 infrared4)
	(have_image Planet58 thermograph1)
	(have_image Star59 infrared0)
	(have_image Phenomenon60 infrared0)
	(have_image Planet61 image3)
	(have_image Planet62 infrared0)
	(have_image Star63 infrared0)
	(have_image Phenomenon64 thermograph1)
))

)

; plan
1. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 28
2. (calibrate satellite3 instrument10 groundstation30)
   added: (calibrated instrument10)
   goals met: 0 of 28
3. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 28
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 28
5. (turn_to satellite3 phenomenon50 groundstation30)
   deleted: (pointing satellite3 groundstation30)
   added: (pointing satellite3 phenomenon50)
   goals met: 0 of 28
6. (take_image satellite3 phenomenon50 instrument10 thermograph1)
   added: (have_image phenomenon50 thermograph1)
   goals met: 1 of 28
7. (turn_to satellite3 phenomenon52 phenomenon50)
   deleted: (pointing satellite3 phenomenon50)
   added: (pointing satellite3 phenomenon52)
   goals met: 1 of 28
8. (take_image satellite3 phenomenon52 instrument10 thermograph1)
   added: (have_image phenomenon52 thermograph1)
   goals met: 2 of 28
9. (turn_to satellite3 phenomenon54 phenomenon52)
   deleted: (pointing satellite3 phenomenon52)
   added: (pointing satellite3 phenomenon54)
   goals met: 2 of 28
10. (take_image satellite3 phenomenon54 instrument10 thermograph1)
   added: (have_image phenomenon54 thermograph1)
   goals met: 3 of 28
11. (turn_to satellite3 phenomenon56 phenomenon54)
   deleted: (pointing satellite3 phenomenon54)
   added: (pointing satellite3 phenomenon56)
   goals met: 3 of 28
12. (take_image satellite3 phenomenon56 instrument10 thermograph1)
   added: (have_image phenomenon56 thermograph1)
   goals met: 4 of 28
13. (turn_to satellite3 phenomenon64 phenomenon56)
   deleted: (pointing satellite3 phenomenon56)
   added: (pointing satellite3 phenomenon64)
   goals met: 4 of 28
14. (take_image satellite3 phenomenon64 instrument10 thermograph1)
   added: (have_image phenomenon64 thermograph1)
   goals met: 5 of 28
15. (turn_to satellite3 planet47 phenomenon64)
   deleted: (pointing satellite3 phenomenon64)
   added: (pointing satellite3 planet47)
   goals met: 5 of 28
16. (take_image satellite3 planet47 instrument10 image3)
   added: (have_image planet47 image3)
   goals met: 6 of 28
17. (turn_to satellite3 planet51 planet47)
   deleted: (pointing satellite3 planet47)
   added: (pointing satellite3 planet51)
   goals met: 6 of 28
18. (take_image satellite3 planet51 instrument10 image3)
   added: (have_image planet51 image3)
   goals met: 7 of 28
19. (turn_to satellite3 planet58 planet51)
   deleted: (pointing satellite3 planet51)
   added: (pointing satellite3 planet58)
   goals met: 7 of 28
20. (take_image satellite3 planet58 instrument10 thermograph1)
   added: (have_image planet58 thermograph1)
   goals met: 8 of 28
21. (turn_to satellite3 planet61 planet58)
   deleted: (pointing satellite3 planet58)
   added: (pointing satellite3 planet61)
   goals met: 8 of 28
22. (take_image satellite3 planet61 instrument10 image3)
   added: (have_image planet61 image3)
   goals met: 9 of 28
23. (turn_to satellite3 star16 planet61)
   deleted: (pointing satellite3 planet61)
   added: (pointing satellite3 star16)
   goals met: 10 of 28
24. (turn_to satellite2 phenomenon40 groundstation31)
   deleted: (pointing satellite2 groundstation31)
   added: (pointing satellite2 phenomenon40)
   goals met: 11 of 28
25. (turn_to satellite0 planet55 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet55)
   goals met: 11 of 28
26. (turn_to satellite3 star53 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star53)
   goals met: 10 of 28
27. (take_image satellite3 star53 instrument10 thermograph1)
   added: (have_image star53 thermograph1)
   goals met: 11 of 28
28. (turn_to satellite3 star16 star53)
   deleted: (pointing satellite3 star53)
   added: (pointing satellite3 star16)
   goals met: 12 of 28
29. (turn_to satellite1 star9 star63)
   deleted: (pointing satellite1 star63)
   added: (pointing satellite1 star9)
   goals met: 12 of 28
30. (calibrate satellite1 instrument5 star9)
   added: (calibrated instrument5)
   goals met: 12 of 28
31. (turn_to satellite1 phenomenon40 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon40)
   goals met: 12 of 28
32. (take_image satellite1 phenomenon40 instrument5 infrared0)
   added: (have_image phenomenon40 infrared0)
   goals met: 13 of 28
33. (turn_to satellite1 phenomenon42 phenomenon40)
   deleted: (pointing satellite1 phenomenon40)
   added: (pointing satellite1 phenomenon42)
   goals met: 13 of 28
34. (take_image satellite1 phenomenon42 instrument5 infrared0)
   added: (have_image phenomenon42 infrared0)
   goals met: 14 of 28
35. (turn_to satellite1 phenomenon46 phenomenon42)
   deleted: (pointing satellite1 phenomenon42)
   added: (pointing satellite1 phenomenon46)
   goals met: 14 of 28
36. (take_image satellite1 phenomenon46 instrument5 infrared0)
   added: (have_image phenomenon46 infrared0)
   goals met: 15 of 28
37. (turn_to satellite1 phenomenon49 phenomenon46)
   deleted: (pointing satellite1 phenomenon46)
   added: (pointing satellite1 phenomenon49)
   goals met: 15 of 28
38. (take_image satellite1 phenomenon49 instrument5 infrared0)
   added: (have_image phenomenon49 infrared0)
   goals met: 16 of 28
39. (turn_to satellite1 phenomenon60 phenomenon49)
   deleted: (pointing satellite1 phenomenon49)
   added: (pointing satellite1 phenomenon60)
   goals met: 16 of 28
40. (take_image satellite1 phenomenon60 instrument5 infrared0)
   added: (have_image phenomenon60 infrared0)
   goals met: 17 of 28
41. (turn_to satellite1 planet41 phenomenon60)
   deleted: (pointing satellite1 phenomenon60)
   added: (pointing satellite1 planet41)
   goals met: 17 of 28
42. (take_image satellite1 planet41 instrument5 infrared0)
   added: (have_image planet41 infrared0)
   goals met: 18 of 28
43. (turn_to satellite1 planet45 planet41)
   deleted: (pointing satellite1 planet41)
   added: (pointing satellite1 planet45)
   goals met: 18 of 28
44. (take_image satellite1 planet45 instrument5 infrared0)
   added: (have_image planet45 infrared0)
   goals met: 19 of 28
45. (turn_to satellite1 planet48 planet45)
   deleted: (pointing satellite1 planet45)
   added: (pointing satellite1 planet48)
   goals met: 19 of 28
46. (take_image satellite1 planet48 instrument5 infrared0)
   added: (have_image planet48 infrared0)
   goals met: 20 of 28
47. (turn_to satellite1 planet57 planet48)
   deleted: (pointing satellite1 planet48)
   added: (pointing satellite1 planet57)
   goals met: 21 of 28
48. (turn_to satellite1 planet62 planet57)
   deleted: (pointing satellite1 planet57)
   added: (pointing satellite1 planet62)
   goals met: 20 of 28
49. (take_image satellite1 planet62 instrument5 infrared0)
   added: (have_image planet62 infrared0)
   goals met: 21 of 28
50. (turn_to satellite1 planet57 planet62)
   deleted: (pointing satellite1 planet62)
   added: (pointing satellite1 planet57)
   goals met: 22 of 28
51. (turn_to satellite1 star59 planet57)
   deleted: (pointing satellite1 planet57)
   added: (pointing satellite1 star59)
   goals met: 21 of 28
52. (take_image satellite1 star59 instrument5 infrared0)
   added: (have_image star59 infrared0)
   goals met: 22 of 28
53. (turn_to satellite1 planet57 star59)
   deleted: (pointing satellite1 star59)
   added: (pointing satellite1 planet57)
   goals met: 23 of 28
54. (turn_to satellite1 star63 planet57)
   deleted: (pointing satellite1 planet57)
   added: (pointing satellite1 star63)
   goals met: 22 of 28
55. (take_image satellite1 star63 instrument5 infrared0)
   added: (have_image star63 infrared0)
   goals met: 23 of 28
56. (turn_to satellite1 planet57 star63)
   deleted: (pointing satellite1 star63)
   added: (pointing satellite1 planet57)
   goals met: 24 of 28
57. (turn_to satellite0 star35 planet55)
   deleted: (pointing satellite0 planet55)
   added: (pointing satellite0 star35)
   goals met: 24 of 28
58. (calibrate satellite0 instrument0 star35)
   added: (calibrated instrument0)
   goals met: 24 of 28
59. (turn_to satellite0 planet55 star35)
   deleted: (pointing satellite0 star35)
   added: (pointing satellite0 planet55)
   goals met: 24 of 28
60. (take_image satellite0 planet55 instrument0 infrared4)
   added: (have_image planet55 infrared4)
   goals met: 25 of 28
61. (turn_to satellite0 planet57 planet55)
   deleted: (pointing satellite0 planet55)
   added: (pointing satellite0 planet57)
   goals met: 25 of 28
62. (take_image satellite0 planet57 instrument0 infrared4)
   added: (have_image planet57 infrared4)
   goals met: 26 of 28
63. (turn_to satellite0 star43 planet57)
   deleted: (pointing satellite0 planet57)
   added: (pointing satellite0 star43)
   goals met: 26 of 28
64. (take_image satellite0 star43 instrument0 thermograph2)
   added: (have_image star43 thermograph2)
   goals met: 27 of 28
65. (turn_to satellite0 star44 star43)
   deleted: (pointing satellite0 star43)
   added: (pointing satellite0 star44)
   goals met: 27 of 28
66. (take_image satellite0 star44 instrument0 thermograph2)
   added: (have_image star44 thermograph2)
   goals met: 28 of 28
